## Plan Result (.)
[CI link](https://circleci.com/gh/jinugasachio/terraform-workspace-type/211)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_s3_bucket.bucket
  * aws_vpc.exa


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_s3_bucket.bucket will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_vpc.exa will be created
  + resource "aws_vpc" "exa" {
      + arn                            = (known after apply)
      + cidr_block                     = "10.0.0.0/16"
      + default_network_acl_id         = (known after apply)
      + default_route_table_id         = (known after apply)
      + default_security_group_id      = (known after apply)
      + dhcp_options_id                = (known after apply)
      + enable_classiclink             = (known after apply)
      + enable_classiclink_dns_support = (known after apply)
      + enable_dns_hostnames           = (known after apply)
      + enable_dns_support             = true
      + id                             = (known after apply)
      + instance_tenancy               = "default"
      + ipv6_association_id            = (known after apply)
      + ipv6_cidr_block                = (known after apply)
      + main_route_table_id            = (known after apply)
      + owner_id                       = (known after apply)
      + tags_all                       = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>



<details><summary>:warning: Note: Objects have changed outside of Terraform</summary>

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_iam_role.administrator has changed
  ~ resource "aws_iam_role" "administrator" {
        id                    = "administrator"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AdministratorAccess",
        ]
        name                  = "administrator"
      + tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobID":"8957a565-d1f4-4276-88c0-bd5a67e90f75","JobName":"terraform_plan","PRNumber":11,"Program":"tfcmt","SHA1":"d02ca1a16e0181ae14d80ad02ad8f1afc9ecae6f","Target":".","Vars":{}} -->